Белгипрозем_2017/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <predefined>
    <items>
      <name>ОтветственныйЗаКонтрольИсполнения</name>
      <description>Координатор выполнения задач</description>
    </items>
    <items>
      <name>СотрудникСТКК</name>
      <description>Сотрудник СТКК</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользуетсяБезОбъектовАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСОбъектамиАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДополнительногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыОсновногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяРоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.ОбменВнешнимиЗаданиямиС1СДокументооборот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/ОбменВнешнимиЗаданиямиСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ВНЕШНИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// получает узел из регистра сведений УзлыРолиИсполнителей (если он там есть)
Функция ПолучитьУзелИзРегистраИсточникиВнешнихЗадач(ОбъектСсылка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// записывает запись в регистр сведений ИсточникиВнешнихЗадач 
Процедура ЗаписатьУзелВРегистрИсточникиВнешнихЗадач(ОбъектСсылка, УзелОбмена) Экспорт
	
КонецПроцедуры

// очищает все записи с данным узлом
Процедура ОчиститьРегистрИсточникиВнешнихЗадач(УзелИсточник) Экспорт 
	
КонецПроцедуры	

// Вернет Истина, если ВерсияФайла принадлежит внешней роли
Функция ВерсияФайлаПринадлежитВнешнейРоли(Владелец) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫРАЗИТЬ(Файлы.ВладелецФайла КАК БизнесПроцесс.Поручение).Исполнитель КАК Справочник.РолиИсполнителей).ВнешняяРоль, ЛОЖЬ) КАК ВнешняяРоль
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.Ссылка = &Ссылка";
						   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВнешняяРоль;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

// Вернет УзелОбмена роли, если ВерсияФайла принадлежит внешней роли
Функция ПолучитьУзелОбменаДляВерсииФайла(Владелец) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(ВЫРАЗИТЬ(Файлы.ВладелецФайла КАК БизнесПроцесс.Поручение).Исполнитель КАК Справочник.РолиИсполнителей).УзелОбмена, НЕОПРЕДЕЛЕНО) КАК УзелОбмена
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.Ссылка = &Ссылка";
						   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УзелОбмена;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	

// Вернет Истина, если Файл принадлежит внешней роли
Функция ФайлПринадлежитВнешнейРоли(ВладелецФайла) Экспорт
	
	Если ТипЗнч(ВладелецФайла) <> Тип("БизнесПроцессСсылка.Поручение") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВладелецФайла);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(Поручение.Исполнитель КАК Справочник.РолиИсполнителей).ВнешняяРоль, ЛОЖЬ) КАК ВнешняяРоль
	               |ИЗ
	               |	БизнесПроцесс.Поручение КАК Поручение
	               |ГДЕ
	               |	Поручение.Ссылка = &Ссылка";
						   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВнешняяРоль;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

// Вернет УзелОбмена роли, если Файл принадлежит внешней роли
Функция ПолучитьУзелОбменаДляФайла(ВладелецФайла) Экспорт
	
	Если ТипЗнч(ВладелецФайла) <> Тип("БизнесПроцессСсылка.Поручение") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВладелецФайла);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(Поручение.Исполнитель КАК Справочник.РолиИсполнителей).УзелОбмена, НЕОПРЕДЕЛЕНО) КАК УзелОбмена
	               |ИЗ
	               |	БизнесПроцесс.Поручение КАК Поручение
	               |ГДЕ
	               |	Поручение.Ссылка = &Ссылка";
						   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УзелОбмена;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
